export const dataToImport = {
  database: 'db-from-json',
  version: 1,
  encrypted: false,
  mode: 'full',
  tables: [
    {
      name: 'users',
      schema: [
        { column: 'id', value: 'INTEGER PRIMARY KEY NOT NULL' },
        { column: 'email', value: 'TEXT UNIQUE NOT NULL' },
        { column: 'name', value: 'TEXT' },
        { column: 'age', value: 'INTEGER' },
        { column: 'sql_deleted', value: 'BOOLEAN DEFAULT 0 CHECK (sql_deleted IN (0, 1))' },
        { column: 'last_modified', value: "INTEGER DEFAULT (strftime('%s', 'now'))" },
      ],
      indexes: [
        { name: 'index_user_on_name', value: 'name' },
        { name: 'index_user_on_last_modified', value: 'last_modified DESC' },
        {
          name: 'index_user_on_email_name',
          value: 'email ASC, name',
          mode: 'UNIQUE',
        },
      ],
      values: [
        [1, 'Whiteley.com', 'Whiteley', 30, 0, 1582536810],
        [2, 'Jones.com', 'Jones', 44, 0, 1582812800],
        [3, 'Simpson@example.com', 'Simpson', 69, 0, 1583570630],
        [4, 'Brown@example.com', 'Brown', 15, 0, 1590383895],
        [5, 'Bfjlsdkfjl.com', 'David', 55, 0, 1590383895],
        [6, 'sfsd@example.com', 'Brown', 35, 0, 1590383895],
        [7, 'nfweoif@example.com', 'Wilson', 20, 0, 1590383895],
        [8, 'uiort@example.com', 'Watson', 25, 0, 1590383895],
        [9, 'asdfkj@example.com', 'Robin', 30, 0, 1590383895],
      ],
    },
    {
      name: 'messages',
      schema: [
        { column: 'id', value: 'INTEGER PRIMARY KEY NOT NULL' },
        { column: 'userid', value: 'INTEGER' },
        { column: 'title', value: 'TEXT NOT NULL' },
        { column: 'body', value: 'TEXT NOT NULL' },
        { column: 'sql_deleted', value: 'BOOLEAN DEFAULT 0 CHECK (sql_deleted IN (0, 1))' },
        { column: 'last_modified', value: "INTEGER DEFAULT (strftime('%s', 'now'))" },
        {
          foreignkey: 'userid',
          value: 'REFERENCES users(id) ON DELETE CASCADE',
        },
      ],
      indexes: [
        { name: 'index_messages_on_title', value: 'title' },
        {
          name: 'index_messages_on_last_modified',
          value: 'last_modified DESC',
        },
      ],
      values: [
        [1, 1, 'test post 1', 'content test post 1', 0, 1587310030],
        [2, 2, 'test post 2', 'content test post 2', 0, 1590388125],
        [3, 1, 'test post 3', 'content test post 3', 0, 1590383895],
        [4, 3, 'test post 4', 'content test post 4', 0, 1590383895],
        [5, 4, 'test post 5', 'content test post 5', 0, 1590383895],
        [6, 1, 'test post 6', 'content test post 6', 0, 1590383895],
        [7, 2, 'test post 7', 'content test post 7', 0, 1590383895],
        [8, 4, 'test post 8', 'content test post 8', 0, 1590383895],
        [9, 1, 'test post 9', 'content test post 9', 0, 1590383895],
        [10, 1, 'test post 10', 'content test post 10', 0, 1590383895],
        [11, 1, 'test post 11', 'content test post 11', 0, 1590383895],
        [12, 2, 'test post 12', 'content test post 12', 0, 1590383895],
        [13, 2, 'test post 13', 'content test post 13', 0, 1590383895],
      ],
    },

    {
      name: 'tafsirs',
      schema: [
        { column: 'id', value: 'INTEGER PRIMARY KEY NOT NULL' },
        { column: 'title', value: 'TEXT' },
        { column: 'tafsir', value: 'TEXT' },
        { column: 'sql_deleted', value: 'BOOLEAN DEFAULT 0 CHECK (sql_deleted IN (0, 1))' },
        // { column: 'last_modified', value: "INTEGER DEFAULT (strftime('%s', 'now'))" },
      ],
      // indexes: [{ name: 'index_tafsirs_on_last_modified', value: 'last_modified DESC' }],
      values: [
        [
          1,
          'তাফসির ১',
          `[১] (غيب)- এর অর্থ হচ্ছে এমনসব বস্তু যা বাহ্যিকভাবে মানবকুলের জ্ঞানের উর্ধের্ব এবং যা মানুষ পঞ্চ-ইন্দ্রিয়ের দ্বারা অনুভব করতে পারে না, চক্ষু দ্বারা দেখতে পায় না, কান দ্বারা শুনতে পায় না, নাসিকা দ্বারা ঘাণ নিতে পারে না, জিহ্‌বা দ্বারা স্বাদ গ্রহণ করতে পারে না, হাত দ্বারা স্পর্শ করতে পারে না, ফলে সে সম্পর্কে জ্ঞান লাভও করতে পারে না। কুরআনে (غيب) শব্দ দ্বারা সে সমস্ত বিষয়কেই বোঝানো হয়েছে যেগুলোর সংবাদ রাসূল সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম দিয়েছেন এবং মানুষ যে সমস্ত বিষয়ে স্বীয় বুদ্ধিবলে ও ইন্দ্রিয়গ্রাহ্য অভিজ্ঞতার মধ্যমে জ্ঞান লাভে সম্পূর্ণ অক্ষম। এখানে (غيب) শব্দ দ্বারা ঈমানের সংক্ষিপ্ত বর্ণনা দেয়া হয়েছে। যার মধ্যে আল্লাহ্‌র অস্তিত্ব ও সত্তা, সিফাত বা গুণাবলী এবং তাকদীর সম্পর্কিত বিষয়সমূহ, জান্নাত-জাহান্নামের অবস্থা, কেয়ামত এবং কেয়ামতে অনুষ্ঠিত হওয়ার ঘটনাসমূহ, ফেরেশ্‌তাকুল, সমস্ত আসমানী কিতাব, পূর্ববর্তী সকল নবী ও রাসূলগণের বিস্তারিত বিষয় অন্তর্ভুক্ত যা সূরা আল-বাকারাহ্‌র (اٰمَنَ الرَّسُوْلُ) আয়াতে দেয়া হয়েছে। এখানে ঈমানের সংক্ষিপ্ত বর্ণনা আর এ সূরারই শেষে ২৮৫ নং আয়াতে ঈমানের বিস্তারিত বর্ণনা রয়েছে।

        [২] ঈমান এবং গায়েব। শব্দ দু’টির অর্থ যথার্থভাবে অনুধাবন করলেই ঈমানের পুরোপুরি তাৎপর্য ও সংজ্ঞা হৃদয়ঙ্গম করা সম্ভব হবে। ঈমান শব্দের আভিধানিক অর্থ হচ্ছে, ‘কোন বিষয়ের স্বীকৃতি দেয়া’। ইসলামী শরী’আতের পরিভাষায় ইমান বলতে বুঝায়, কোন বিষয়ে মুখের স্বীকৃতির মাধ্যমে অন্তরে দৃঢ় বিশ্বাস পোষণ করা এবং তা কাজে পরিণত করা। এখানে ঈমানের তিনটি দিক তুলে ধরা হয়েছে। প্রথমতঃ অন্তরে অকপট চিত্তে দৃঢ় বিশ্বাস পোষণ করা। দ্বিতীয়তঃ সে বিষয়ের স্বীকৃতি মুখে দেয়া। তৃতীয়তঃ কর্মকাণ্ডে তার বাস্তবায়ন করা। শুধু বিশ্বাসের নামই ঈমান নয়। কেননা খোদ ইব্‌লিস, ফির’আউন এবং অনেক কাফেরও মনে মনে বিশ্বাস করত। কিন্তু না মানার কারণে তারা ঈমানদারদের অন্তর্ভুক্ত হতে পারেনি। তদ্রুপ শুধু মুখে স্বীকৃতির নামও ঈমান নয়। কারণ মুনাফেকরা মুখে স্বীকৃতি দিত। বরং ঈমান হচ্ছে জানা ও মানার নাম। বিশ্বাস করা, মুখে স্বীকৃতি দেয়া এবং কার্যে পরিণত করা -এ তিনটির সমষ্টির নাম ঈমান। তাছাড়া ঈমান বাড়ে ও কমে। উপরোক্ত আলোচনার প্রেক্ষিতে ঈমান বিল-গায়েব অর্থ এই দাঁড়ায় যে, রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম যে হেদায়াত এবং শিক্ষা নিয়ে এসেছিলেন, সে সবগুলোকে আন্তরিকভাবে মেনে নেয়া। তবে শর্ত হচ্ছে যে, সেগুলো রাসূল সাল্লাল্লাহু ‘‘আলাইহি ওয়াসাল্লাম এর শিক্ষা হিসেবে অকাট্যভাবে প্রমাণিত হতে হবে। আহ্‌লে-ইসলামের সংখ্যাগরিষ্ট দল ঈমানের এ সংজ্ঞাই দিয়েছেন। [ইবনে কাসীর]
        
        ‘ঈমান বিল গায়েব’ সম্পর্কে আব্দুল্লাহ ইবনে মাসউদ রাদিয়াল্লাহু আনহু বলেন, ‘গায়েবের বিষয়াদির উপর ঈমান আনার চেয়ে উত্তম ঈমান আর কারও হতে পারে না। তারপর তিনি এ সূরার প্রথম পাঁচটি আয়াত তেলাওয়াত করলেন।‘ [মুস্তাদরাকে হাকিম: ২/২৬০]
        
        অন্য বর্ণনায় এসেছে, আবু উবাইদাহ ইবনুল জাররাহ রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লামকে জিজ্ঞেস করলেন, হে আল্লাহ্‌র রাসূল! আমরা ইসলাম গ্রহণ করেছি, আপনার সাথে জিহাদ করেছি, আমাদের থেকে উত্তম কি কেউ আছে? রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম বললেন, “হ্যাঁ, তারা তোমাদের পরে এমন একটি জাতি, যারা আমাকে না দেখে আমার উপর ঈমান আনবে [সুনান দারমী: ২/৩০৮, মুস্তাদরাকে হাকিম: ৪/৮৫]
        
        মূলত: এটি ‘ঈমান বিল গায়েব’ এর একটি উদাহরণ। সাহাবা, তাবে’য়ীনদের থেকে বিভিন্ন বর্ণনায় ঈমান বিল গায়েবের বিভিন্ন উদাহরন পেশ করা হয়েছে। কেউ বলেছেন, কুরআন। আবার কেউ বলেছেন, জান্নাত ও জাহান্নাম। [আত-তাফসীরুস সহীহ:৯৯] এ সবগুলোই ঈমান বিল গায়েবের উদাহরণ। ঈমানের ছয়টি রুকন সংক্রান্ত যাবতীয় বিষয়াদি ঈমান বিল গায়েবের মূল অংশ।
        
        [৩] ‘সালাত’-এর শাব্দিক অর্থ হচ্ছে প্রার্থনা বা দো'আ। শরী’আতের পরিভাষায় সে বিশেষ ইবাদাত, যা আমাদের নিকট ‘নামায’ হিসেবে পরিচিত। কুরআনুল কারীমে যতবার সালাতের তাকীদ দেয়া হয়েছে - সাধারণতঃ ইকামত' শব্দের দ্বারাই দেয়া হয়েছে। সালাত আদায়ের কথা শুধু দু’এক জায়গায় বলা হয়েছে। এ জন্য ‘ইকামাতুস সালাত’ (সালাত প্রতিষ্ঠা)-এর মর্ম অনুধাবন করা উচিত। ‘ইকামত’ এর শাব্দিক অর্থ সোজা করা, স্থায়ী রাখা। সাধারণতঃ যেসব খুঁটি, দেয়াল বা গাছ প্রভৃতির আশ্রয়ে সোজাভাবে দাঁড়ানো থাকে, সেগুলো স্থায়ী থাকে এবং পড়ে যাওয়ার আশংকা কম থাকে। এজন্য ‘ইকামত' স্থায়ী ও স্থিতিশীল অর্থেও ব্যবহৃত হয়।
        
        কুরআন ও সুন্নাহর পরিভাষায় ‘ইকামাতুস সালাত’ অর্থ, নির্ধারিত সময় অনুসারে যাবতীয় শর্তাদি ও নিয়মাবলী রক্ষা করে সালাত আদায় করা। শুধু সালাত আদায় করাকে ‘ইকামাতুস সালাত’ বলা হয় না। সালাতের যত গুণাবলী, ফলাফল, লাভ ও বরকতের কথা কুরআন হাদীসে বর্ণনা করা হয়েছে, তা সবই ‘ইকামাতুস সালাত’ (সালাত প্রতিষ্ঠা)-এর সাথে সম্পর্কযুক্ত। যেমন, কুরআনুল কারীমে আছে – ‘নিশ্চয়ই সালাত মানুষকে যাবতীয় অশ্লীল ও গৰ্হিত কাজ থেকে বিরত রাখে। [সূরা আল-আনকাবুত:৪৫]
        
        বস্তুত: সালাতের এ ফল ও ক্রিয়ার তখনই প্রকাশ ঘটবে, যখন সালাত উপরে বর্ণিত অর্থে প্রতিষ্ঠা করা হবে। এ জন্য অনেক সালাত আদায়কারীকে অশ্লীল ও নেক্কারজনক কাজে জড়িত দেখে এ আয়াতের মর্ম সম্পর্কে সন্দেহ পোষণ করা ঠিক হবে না। কেননা, তারা সালাত আদায় করেছে বটে, কিন্তু প্রতিষ্ঠা করেনি। সুতরাং সালাতকে সকল দিক দিয়ে ঠিক করাকে প্রতিষ্ঠা করা বলা হবে। ‘ইকামত’ অর্থে সালাতে সকল ফরয-ওয়াজিব, সুন্নাত, মুস্তাহাব পরিপূর্ণভাবে আদায় করা, এতে সব সময় সুদৃঢ় থাকা এবং এর ব্যবস্থাপনা সুদৃঢ় করা সবই বোঝায়। তাছাড়া সময়মত আদায় করা। সালাতের রুকু, সাজদাহ, তিলাওয়াত, খুশু, খুযু ঠিক রাখাও এর অন্তর্ভুক্ত। [ইবনে কাসীর] ফরয-ওয়াজিব, সুন্নাত ও নফল প্রভৃতি সকল সালাতের জন্য একই শর্ত। এক কথায় সালাতে অভ্যস্ত হওয়া ও তা শরী’আতের নিয়মানুযায়ী আদায় করা এবং এর সকল নিয়ম-পদ্ধতি যথার্থভাবে পালন করাই ইকামতে সালাত। তন্মধ্যে রয়েছে - জামাআতের মাধ্যমে সালাত আদায়ের ব্যবস্থা করা। আর তা বাস্তাবায়নের জন্য সকল ক্ষমতা প্রয়োগ করা। প্রয়োজনে রাষ্ট্রীয়ভাবে তার তদারকির ব্যবস্থা করা। আল্লাহ্‌ তা'আলা ইসলামী কল্যাণ-রাষ্ট্রের যে রূপরেখা প্রণয়ন করেছেন তার মধ্যে সালাত কায়েম করাকে রাষ্ট্রীয় ক্ষমতাসীনদের অন্যতম কর্ম বলে ঘোষণা করে বলেনঃ “যাদেরকে আমরা যমীনের বুকে প্রতিষ্ঠা দান করলে তারা সালাত কায়েম করবে, যাকাত দিবে, সৎকাজের নির্দেশ দিবে এবং অসৎ কাজের নিষেধ করবে। " [সূরা আল-হাজ্জঃ ৪১]
        
        [৪] আল্লাহ্‌র পথে ব্যয় অর্থে এখানে ফরয যাকাত, ওয়াজিব সদকা এবং নফল দান-সদকা প্রভৃতি যা আল্লাহ্‌র রাস্তায় ব্যয় করা হয় সে সবকিছুকেই বোঝানো হয়েছে। [তাফসীর তাবারী]
        
        কুরআনে সাধারণত ‘ইনফাক’ নফল দান-সদকার জন্যই ব্যবহৃত হয়েছে। যেখানে ফরয যাকাত উদ্দেশ্য সেসব ক্ষেত্রে "যাকাত" শব্দ ব্যবহৃত হয়েছে। মুত্তাকীদের গুণাবলী বর্ণনা করতে গিয়ে প্রথমে গায়েবের উপর ঈমান, এরপর সালাত প্রতিষ্ঠা এবং আল্লাহ্‌র পথে ব্যয় করার কথা উল্লেখ করা হয়েছে।`,
          0,
        ],
        [
          2,
          'তাফসির ২',
          `[১] এখানে মুত্তাকীদের এমন আরও কতিপয় গুণাবলীর বর্ণনা রয়েছে, যাতে ঈমান বিল গায়েব এবং আখেরাতের প্রতি বিশ্বাসের প্রসঙ্গটা আরও একটু বিস্তারিতভাবে বর্ণনা করা হয়েছে। রাসূল সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর যুগে মুমিন ও মুত্তাকী দুই শ্রেণীর লোক বিদ্যমান ছিলেন, এক শ্রেণী তারা যারা প্রথমে মুশরিক ছিলেন এবং পরে ইসলাম গ্রহণ করেছেন। অন্য শ্রেণী হলেন যারা প্রথমে আহ্‌লে-কিতাব ইয়াহুদী-নাসারা ছিলেন এবং পরে ইসলাম গ্রহণ করেছেন। পূর্ববতী আয়াতে প্রথম শ্রেণীর বর্ণনা ছিল। এ আয়াতে দ্বিতীয় শ্রেণীর বর্ণনা দেয়া হয়েছে। তাই এ আয়াতে কুরআনের প্রতি ঈমান আনার সাথে সাথে পূর্ববতী আসমানী কিতাবসমূহে বিশ্বাস করার কথাও বলা হয়েছে। হাদীসের বর্ণনা অনুযায়ী এ দ্বিতীয় শ্রেণীর লোকেরা যারা ইসলাম গ্রহণের পূর্বে কোন না কোন আসমানী কিতাবের অনুসারী ছিলেন, তারা দ্বিগুণ পুণ্যের অধিকারী হবেন। [দেখুন, বুখারী: ৩০১১, মুসলিম: ১৫৪]

          প্রথমতঃ কুরআনের প্রতি ঈমান এবং আমলের জন্য, দ্বিতীয়তঃ পূর্ববর্তী কিতাবসমূহে ঈমান আনার জন্য। তবে পার্থক্য এই যে, সেগুলো সম্পর্কে বিশ্বাসের বিষয় হবে, কুরআনের পূর্বে আল্লাহ্ তা'আলা যেসব কিতাব নাযিল করেছেন, সেগুলো সত্য ও হক এবং সে যুগে এর উপর আমল করা ওয়াজিব ছিল। আর এ যুগে কুরআন নাযিল হবার পর যেহেতু অন্যান্য আসমানী কিতাবের হুকুম-আহ্‌কাম এবং পূর্ববতী শরীআতসমূহ মনসুখ হয়ে গেছে, তাই এখন আমল একমাত্র কুরআনের আদেশানুযায়ীই করতে হবে। [ইবনে কাসীর থেকে সংক্ষেপিত]
          
          [২] এ আয়াতে মুত্তাকীগণের আরেকটি গুণ বর্ণনা করা হচ্ছে যে, তারা আখেরাতে নিশ্চিত বিশ্বাস বা দৃঢ় প্রত্যয় রাখে। যেসব বিষয়ের প্রতি ঈমান আনা অপরিহার্য সেগুলোর মধ্যে এ বিষয়টি সর্বাপেক্ষা গুরুত্বপূর্ণ। তাছাড়া ঈমান অনুযায়ী আমল করার প্রকৃত প্রেরণা এখান থেকেই সৃষ্টি হয়। ইসলামী বিশ্বাসগুলোর মধ্যে আখেরাতের প্রতি ঈমান আনা একটি গুরুত্বপূর্ণ বিশ্বাস, যা দুনিয়ার রূপই পাল্টে দিয়েছে। এ বিশ্বাসে উদ্বুদ্ধ হয়েই ওহীর অনুসারীগণ প্রথমে নৈতিকতা ও কর্মে এবং পরবর্তীতে ব্যক্তিগত, সামাজিক এমনকি রাষ্ট্রীয় পর্যায়ে পর্যন্ত দুনিয়ার অন্যান্য সকল জাতির মোকাবেলায় একটি অনন্য বৈশিষ্ট্যপূর্ণ আসনে উত্তীর্ণ হতে সমর্থ হয়েছে। পরন্তু তাওহীদ ও রিসালাতের ন্যায় এ আকীদাও সমস্ত নবী-রাসূলের শিক্ষা ও সর্বপ্রকার ধর্ম-বিশ্বাসের মধ্যেই সর্বসম্মত বিশ্বাসরূপে চলে আসছে। যেসব লোক জীবন ও এর ভোগ-বিলাসকেই জীবনের চরম লক্ষ্য বলে গণ্য করে, জীবনযাত্রার ক্ষেত্রে যে তিক্ত পরিস্থিতির সম্মুখীন হতে হয়, সে তিক্ততাকেই সর্বাপেক্ষা কষ্ট বলে মনে করে, আখেরাতের জীবন, সেখানকার হিসাব-নিকাশ, শাস্তি ও পুরস্কার প্রভৃতি সম্পর্কে যাদের এতটুকুও আস্থা নেই, তারা যখন সত্য-মিথ্যা কিংবা হালাল-হারামের মধ্যে পার্থক্য করাকে তাদের জীবনের সহজ-স্বাচ্ছন্দ্যের পথে বাধারূপে দেখতে পায়, তখন সামান্য একটু সুখ-স্বাচ্ছন্দ্যের বিনিময়ে সকল মূল্যবোধকে বিসর্জন দিতে এতটুকুও কুণ্ঠাবোধ করে না, এমতাবস্থায় এ সমস্ত লোককে যে কোন দুস্কর্ম থেকে বিরত রাখার মত আর কোন কিছুই অবশিষ্ট থাকে না। যা কিছু অন্যায়, অসুন্দর বা অসামাজিক জীবনের শান্তি-শৃংখলার পক্ষে ক্ষতিকর, সেসব অনাচার কার্যকরভাবে উৎখাত করার কোন শক্তি কোন আইনেরও নেই, এ কথা পরীক্ষিত সত্য। আইন প্রয়োগের মাধ্যমে কোন দুরাচারের চরিত্রশুদ্ধি ঘটানোও সম্ভব হয় না। অপরাধ যাদের অভ্যাসে পরিণত হয়ে যায়, আইনের শাস্তি সাধারণত তাদের দাঁত-সওয়া হয়ে পড়ে। শেষ পর্যন্ত আর তাদের মধ্যে শাস্তিকে যারা ভয় করে, তাদের সে ভয়ের আওতাও শুধুমাত্র ততটুকুতেই সীমাবদ্ধ থাকে, যকটুকুতে ধরা পড়ার ভয় বিদ্যমান। কিন্তু গোপনে লোকচক্ষুর অন্তরালে যেখানে ধরা পড়ার সম্ভাবনা থাকে না, সেরূপ পরিবেশে এ সমস্ত লোকের পক্ষেও যে কোন গৰ্হিত কাজে লিপ্ত হওয়ার পথে কোন বাধাই থাকে না। প্রকারান্তরে আখেরাতের প্রতি ঈমানই এমন এক কার্যকর নিয়ন্ত্রণবিধি, যা মানুষকে প্রকাশ্য-অপ্রকাশ্য সর্বত্রই যে কোন গৰ্হিত আচরণ থেকে অত্যন্ত কার্যকারভাবে বিরত রাখে। তার অন্তরে এমন এক প্রত্যয়ের অম্লান শিখা অবিরাম সমুজ্জ্বল করে দেয় যে, আমি প্রকাশ্যেই থাকি আর গভীর নির্জনেই থাকি, রাজপথে থাকি কিংবা কোন বদ্ধঘরে লুকিয়েই থাকি, মুখে বা ভাব-ভঙ্গিতে প্রকাশ করি আর নাই করি, আমার সকল আচরণ, আমার সকল অভিব্যক্তি, এমনকি অন্তরে লুক্বায়িত প্রতিটি আকাংখা পর্যন্ত এক মহাসত্তার সামনে রয়েছে। তাঁর সদাজাগ্রত দৃষ্টির সামনে কোন কিছুই আড়াল করার সাধ্য আমার নেই। আমার সংগে রয়েছে এমনসব প্রহরী, যারা আমার প্রতিটি আচরণ এবং অভিব্যক্তি প্রতিমুহুর্তেই লিপিবদ্ধ করছেন।
          উপরোক্ত বিশ্বাসের মাধ্যমেই প্রাথমিক যুগে এমন মহোত্তম চরিত্রের অগণিত লোক সৃষ্টি হয়েছিলেন, যাদের চাল-চলন এবং আচার-আচরণ দেখেই মানুষ ইসলামের প্রতি শ্রদ্ধায় অবনত হয়ে পড়ত। এখন লক্ষণীয় আর একটি বিষয় হচ্ছে, আয়াতের শেষে (يُؤمِنُوْنَ) শব্দ ব্যবহার না করে (يُوْقِنُوْنَ) ব্যবহার করা হয়েছে। ইয়াক্বীন অর্থ দৃঢ় প্রত্যয়। যার দ্বারা ইঙ্গিত করা হয়েছে যে, আখেরাতের প্রতি এমন দৃঢ় প্রত্যয় রাখতে হবে, যে প্রত্যয় স্বচক্ষে দেখা কোন বস্তু সম্পর্কেই হতে পারে। এ দৃঢ় প্রত্যয়ের গুরুত্ব নির্ধারণে আবদুল্লাহ ইবনে মাসউদ রাদিয়াল্লাহু আনহু বলেন, সবর হচ্ছে ঈমানের অর্ধেক, আর ইয়াকীন হচ্ছে পূর্ণ ঈমান” [মুস্তাদরাকে হাকিম: ২/৪৪৬]
          
          মুত্তাকীদের এই গুণ আখেরাতে আল্লাহ্‌ তা'আলার সম্মুখে উপস্থিতি এবং হিসাবনিকাশ, প্রতিদান এবং সবকিছুরই একটি পরিপূর্ণ নকশা তার সামনে দৃশ্যমান করে রাখবে। যে ব্যক্তি অন্যের হক নষ্ট করার জন্য মিথ্যা মামলা করে বা মিথ্যা সাক্ষ্য দেয়, আল্লাহ্‌র আদেশের বিপরীত পথে হারাম ধন-দৌলত উপার্জন করে এবং দুনিয়ার হীন উদ্দেশ্য সফল করার জন্য শরীআত বিরোধী কাজ করে, সে ব্যক্তি আখেরাতে বিশ্বাসী হয়ে, প্রকাশ্যে ঈমানের কথা যদি স্বীকার করে এবং শরী’আতের বিচারে তাকে মুমিনও বলা হয়, কিন্তু কুরআন যে ইয়াকীনের কথা ঘোষণা করেছে, এমন লোকের মধ্যে সে ইয়াকীন থাকতে পারে না। আর সে কুরআনী ইয়াকীনই মানবজীবনে গুরুত্বপূর্ণ পরিবর্তন এনে দিতে পারে। আর এর পরিণামেই মুত্তাকীগণকে হেদায়াত এবং সফলতার সে পুরস্কার দেয়া হয়েছে, যাতে বলা হয়েছে যে, তারাই সরল-সঠিক পথের পথিক, যা তাদের পালনকর্তার পক্ষ থেকে দান করা হয়েছে আর তারাই সম্পূর্ণ সফলকাম হয়েছে।`,
          0,
        ],
        [
          3,
          'তাফসির ৩',
          `[১] এখানে মুত্তাকীদের এমন আরও কতিপয় গুণাবলীর বর্ণনা রয়েছে, যাতে ঈমান বিল গায়েব এবং আখেরাতের প্রতি বিশ্বাসের প্রসঙ্গটা আরও একটু বিস্তারিতভাবে বর্ণনা করা হয়েছে। রাসূল সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর যুগে মুমিন ও মুত্তাকী দুই শ্রেণীর লোক বিদ্যমান ছিলেন, এক শ্রেণী তারা যারা প্রথমে মুশরিক ছিলেন এবং পরে ইসলাম গ্রহণ করেছেন। অন্য শ্রেণী হলেন যারা প্রথমে আহ্‌লে-কিতাব ইয়াহুদী-নাসারা ছিলেন এবং পরে ইসলাম গ্রহণ করেছেন। পূর্ববতী আয়াতে প্রথম শ্রেণীর বর্ণনা ছিল। এ আয়াতে দ্বিতীয় শ্রেণীর বর্ণনা দেয়া হয়েছে। তাই এ আয়াতে কুরআনের প্রতি ঈমান আনার সাথে সাথে পূর্ববতী আসমানী কিতাবসমূহে বিশ্বাস করার কথাও বলা হয়েছে। হাদীসের বর্ণনা অনুযায়ী এ দ্বিতীয় শ্রেণীর লোকেরা যারা ইসলাম গ্রহণের পূর্বে কোন না কোন আসমানী কিতাবের অনুসারী ছিলেন, তারা দ্বিগুণ পুণ্যের অধিকারী হবেন। [দেখুন, বুখারী: ৩০১১, মুসলিম: ১৫৪]

          প্রথমতঃ কুরআনের প্রতি ঈমান এবং আমলের জন্য, দ্বিতীয়তঃ পূর্ববর্তী কিতাবসমূহে ঈমান আনার জন্য। তবে পার্থক্য এই যে, সেগুলো সম্পর্কে বিশ্বাসের বিষয় হবে, কুরআনের পূর্বে আল্লাহ্ তা'আলা যেসব কিতাব নাযিল করেছেন, সেগুলো সত্য ও হক এবং সে যুগে এর উপর আমল করা ওয়াজিব ছিল। আর এ যুগে কুরআন নাযিল হবার পর যেহেতু অন্যান্য আসমানী কিতাবের হুকুম-আহ্‌কাম এবং পূর্ববতী শরীআতসমূহ মনসুখ হয়ে গেছে, তাই এখন আমল একমাত্র কুরআনের আদেশানুযায়ীই করতে হবে। [ইবনে কাসীর থেকে সংক্ষেপিত]
          
          [২] এ আয়াতে মুত্তাকীগণের আরেকটি গুণ বর্ণনা করা হচ্ছে যে, তারা আখেরাতে নিশ্চিত বিশ্বাস বা দৃঢ় প্রত্যয় রাখে। যেসব বিষয়ের প্রতি ঈমান আনা অপরিহার্য সেগুলোর মধ্যে এ বিষয়টি সর্বাপেক্ষা গুরুত্বপূর্ণ। তাছাড়া ঈমান অনুযায়ী আমল করার প্রকৃত প্রেরণা এখান থেকেই সৃষ্টি হয়। ইসলামী বিশ্বাসগুলোর মধ্যে আখেরাতের প্রতি ঈমান আনা একটি গুরুত্বপূর্ণ বিশ্বাস, যা দুনিয়ার রূপই পাল্টে দিয়েছে। এ বিশ্বাসে উদ্বুদ্ধ হয়েই ওহীর অনুসারীগণ প্রথমে নৈতিকতা ও কর্মে এবং পরবর্তীতে ব্যক্তিগত, সামাজিক এমনকি রাষ্ট্রীয় পর্যায়ে পর্যন্ত দুনিয়ার অন্যান্য সকল জাতির মোকাবেলায় একটি অনন্য বৈশিষ্ট্যপূর্ণ আসনে উত্তীর্ণ হতে সমর্থ হয়েছে। পরন্তু তাওহীদ ও রিসালাতের ন্যায় এ আকীদাও সমস্ত নবী-রাসূলের শিক্ষা ও সর্বপ্রকার ধর্ম-বিশ্বাসের মধ্যেই সর্বসম্মত বিশ্বাসরূপে চলে আসছে। যেসব লোক জীবন ও এর ভোগ-বিলাসকেই জীবনের চরম লক্ষ্য বলে গণ্য করে, জীবনযাত্রার ক্ষেত্রে যে তিক্ত পরিস্থিতির সম্মুখীন হতে হয়, সে তিক্ততাকেই সর্বাপেক্ষা কষ্ট বলে মনে করে, আখেরাতের জীবন, সেখানকার হিসাব-নিকাশ, শাস্তি ও পুরস্কার প্রভৃতি সম্পর্কে যাদের এতটুকুও আস্থা নেই, তারা যখন সত্য-মিথ্যা কিংবা হালাল-হারামের মধ্যে পার্থক্য করাকে তাদের জীবনের সহজ-স্বাচ্ছন্দ্যের পথে বাধারূপে দেখতে পায়, তখন সামান্য একটু সুখ-স্বাচ্ছন্দ্যের বিনিময়ে সকল মূল্যবোধকে বিসর্জন দিতে এতটুকুও কুণ্ঠাবোধ করে না, এমতাবস্থায় এ সমস্ত লোককে যে কোন দুস্কর্ম থেকে বিরত রাখার মত আর কোন কিছুই অবশিষ্ট থাকে না। যা কিছু অন্যায়, অসুন্দর বা অসামাজিক জীবনের শান্তি-শৃংখলার পক্ষে ক্ষতিকর, সেসব অনাচার কার্যকরভাবে উৎখাত করার কোন শক্তি কোন আইনেরও নেই, এ কথা পরীক্ষিত সত্য। আইন প্রয়োগের মাধ্যমে কোন দুরাচারের চরিত্রশুদ্ধি ঘটানোও সম্ভব হয় না। অপরাধ যাদের অভ্যাসে পরিণত হয়ে যায়, আইনের শাস্তি সাধারণত তাদের দাঁত-সওয়া হয়ে পড়ে। শেষ পর্যন্ত আর তাদের মধ্যে শাস্তিকে যারা ভয় করে, তাদের সে ভয়ের আওতাও শুধুমাত্র ততটুকুতেই সীমাবদ্ধ থাকে, যকটুকুতে ধরা পড়ার ভয় বিদ্যমান। কিন্তু গোপনে লোকচক্ষুর অন্তরালে যেখানে ধরা পড়ার সম্ভাবনা থাকে না, সেরূপ পরিবেশে এ সমস্ত লোকের পক্ষেও যে কোন গৰ্হিত কাজে লিপ্ত হওয়ার পথে কোন বাধাই থাকে না। প্রকারান্তরে আখেরাতের প্রতি ঈমানই এমন এক কার্যকর নিয়ন্ত্রণবিধি, যা মানুষকে প্রকাশ্য-অপ্রকাশ্য সর্বত্রই যে কোন গৰ্হিত আচরণ থেকে অত্যন্ত কার্যকারভাবে বিরত রাখে। তার অন্তরে এমন এক প্রত্যয়ের অম্লান শিখা অবিরাম সমুজ্জ্বল করে দেয় যে, আমি প্রকাশ্যেই থাকি আর গভীর নির্জনেই থাকি, রাজপথে থাকি কিংবা কোন বদ্ধঘরে লুকিয়েই থাকি, মুখে বা ভাব-ভঙ্গিতে প্রকাশ করি আর নাই করি, আমার সকল আচরণ, আমার সকল অভিব্যক্তি, এমনকি অন্তরে লুক্বায়িত প্রতিটি আকাংখা পর্যন্ত এক মহাসত্তার সামনে রয়েছে। তাঁর সদাজাগ্রত দৃষ্টির সামনে কোন কিছুই আড়াল করার সাধ্য আমার নেই। আমার সংগে রয়েছে এমনসব প্রহরী, যারা আমার প্রতিটি আচরণ এবং অভিব্যক্তি প্রতিমুহুর্তেই লিপিবদ্ধ করছেন।
          উপরোক্ত বিশ্বাসের মাধ্যমেই প্রাথমিক যুগে এমন মহোত্তম চরিত্রের অগণিত লোক সৃষ্টি হয়েছিলেন, যাদের চাল-চলন এবং আচার-আচরণ দেখেই মানুষ ইসলামের প্রতি শ্রদ্ধায় অবনত হয়ে পড়ত। এখন লক্ষণীয় আর একটি বিষয় হচ্ছে, আয়াতের শেষে (يُؤمِنُوْنَ) শব্দ ব্যবহার না করে (يُوْقِنُوْنَ) ব্যবহার করা হয়েছে। ইয়াক্বীন অর্থ দৃঢ় প্রত্যয়। যার দ্বারা ইঙ্গিত করা হয়েছে যে, আখেরাতের প্রতি এমন দৃঢ় প্রত্যয় রাখতে হবে, যে প্রত্যয় স্বচক্ষে দেখা কোন বস্তু সম্পর্কেই হতে পারে। এ দৃঢ় প্রত্যয়ের গুরুত্ব নির্ধারণে আবদুল্লাহ ইবনে মাসউদ রাদিয়াল্লাহু আনহু বলেন, সবর হচ্ছে ঈমানের অর্ধেক, আর ইয়াকীন হচ্ছে পূর্ণ ঈমান” [মুস্তাদরাকে হাকিম: ২/৪৪৬]
          
          মুত্তাকীদের এই গুণ আখেরাতে আল্লাহ্‌ তা'আলার সম্মুখে উপস্থিতি এবং হিসাবনিকাশ, প্রতিদান এবং সবকিছুরই একটি পরিপূর্ণ নকশা তার সামনে দৃশ্যমান করে রাখবে। যে ব্যক্তি অন্যের হক নষ্ট করার জন্য মিথ্যা মামলা করে বা মিথ্যা সাক্ষ্য দেয়, আল্লাহ্‌র আদেশের বিপরীত পথে হারাম ধন-দৌলত উপার্জন করে এবং দুনিয়ার হীন উদ্দেশ্য সফল করার জন্য শরীআত বিরোধী কাজ করে, সে ব্যক্তি আখেরাতে বিশ্বাসী হয়ে, প্রকাশ্যে ঈমানের কথা যদি স্বীকার করে এবং শরী’আতের বিচারে তাকে মুমিনও বলা হয়, কিন্তু কুরআন যে ইয়াকীনের কথা ঘোষণা করেছে, এমন লোকের মধ্যে সে ইয়াকীন থাকতে পারে না। আর সে কুরআনী ইয়াকীনই মানবজীবনে গুরুত্বপূর্ণ পরিবর্তন এনে দিতে পারে। আর এর পরিণামেই মুত্তাকীগণকে হেদায়াত এবং সফলতার সে পুরস্কার দেয়া হয়েছে, যাতে বলা হয়েছে যে, তারাই সরল-সঠিক পথের পথিক, যা তাদের পালনকর্তার পক্ষ থেকে দান করা হয়েছে আর তারাই সম্পূর্ণ সফলকাম হয়েছে।`,
          0,
        ],
      ],
    },
  ],
};
